TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v18.1.1.LTS *
       3                    ;* Date/Time created: Fri Mar  9 14:28:11 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/driver
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v18.1.1.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/dr
      13                            .global SlNetIfConfigWifi

    5683                            .dwattr $C$DW$558, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5684                            .dwattr $C$DW$558, DW_AT_decl_line(0x12b)
    5685                            .dwattr $C$DW$558, DW_AT_decl_column(0x05)
    5686                    
    5687                    $C$DW$559       .dwtag  DW_TAG_enumerator
    5688                            .dwattr $C$DW$559, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
    5689                            .dwattr $C$DW$559, DW_AT_const_value(0x04)
    5690                            .dwattr $C$DW$559, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5691                            .dwattr $C$DW$559, DW_AT_decl_line(0x12c)
    5692                            .dwattr $C$DW$559, DW_AT_decl_column(0x05)
    5693                    
    5694                    $C$DW$560       .dwtag  DW_TAG_enumerator
    5695                            .dwattr $C$DW$560, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
    5696                            .dwattr $C$DW$560, DW_AT_const_value(0x05)
    5697                            .dwattr $C$DW$560, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5698                            .dwattr $C$DW$560, DW_AT_decl_line(0x12d)
    5699                            .dwattr $C$DW$560, DW_AT_decl_column(0x05)
    5700                    
    5701                    $C$DW$561       .dwtag  DW_TAG_enumerator
    5702                            .dwattr $C$DW$561, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
    5703                            .dwattr $C$DW$561, DW_AT_const_value(0x06)
    5704                            .dwattr $C$DW$561, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5705                            .dwattr $C$DW$561, DW_AT_decl_line(0x12e)
    5706                            .dwattr $C$DW$561, DW_AT_decl_column(0x05)
    5707                    
    5708                            .dwattr $C$DW$T$455, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5709                            .dwattr $C$DW$T$455, DW_AT_decl_line(0x128)
    5710                            .dwattr $C$DW$T$455, DW_AT_decl_column(0x01)
    5711                            .dwendtag $C$DW$T$455
    5712                    
    5713                    $C$DW$T$456     .dwtag  DW_TAG_typedef
    5714                            .dwattr $C$DW$T$456, DW_AT_name("SlNetSockTxInhibitThreshold_e")
    5715                            .dwattr $C$DW$T$456, DW_AT_type(*$C$DW$T$455)
    5716                            .dwattr $C$DW$T$456, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  105

    5717                            .dwattr $C$DW$T$456, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5718                            .dwattr $C$DW$T$456, DW_AT_decl_line(0x12f)
    5719                            .dwattr $C$DW$T$456, DW_AT_decl_column(0x03)
    5720                    
    5721                    
    5722                    $C$DW$T$457     .dwtag  DW_TAG_enumeration_type
    5723                            .dwattr $C$DW$T$457, DW_AT_byte_size(0x01)
    5724                    $C$DW$562       .dwtag  DW_TAG_enumerator
    5725                            .dwattr $C$DW$562, DW_AT_name("SLNETIF_STATE_DISABLE")
    5726                            .dwattr $C$DW$562, DW_AT_const_value(0x00)
    5727                            .dwattr $C$DW$562, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5728                            .dwattr $C$DW$562, DW_AT_decl_line(0x65)
    5729                            .dwattr $C$DW$562, DW_AT_decl_column(0x05)
    5730                    
    5731                    $C$DW$563       .dwtag  DW_TAG_enumerator
    5732                            .dwattr $C$DW$563, DW_AT_name("SLNETIF_STATE_ENABLE")
    5733                            .dwattr $C$DW$563, DW_AT_const_value(0x01)
    5734                            .dwattr $C$DW$563, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5735                            .dwattr $C$DW$563, DW_AT_decl_line(0x66)
    5736                            .dwattr $C$DW$563, DW_AT_decl_column(0x05)
    5737                    
    5738                            .dwattr $C$DW$T$457, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5739                            .dwattr $C$DW$T$457, DW_AT_decl_line(0x64)
    5740                            .dwattr $C$DW$T$457, DW_AT_decl_column(0x01)
    5741                            .dwendtag $C$DW$T$457
    5742                    
    5743                    $C$DW$T$458     .dwtag  DW_TAG_typedef
    5744                            .dwattr $C$DW$T$458, DW_AT_name("SlNetIfState_e")
    5745                            .dwattr $C$DW$T$458, DW_AT_type(*$C$DW$T$457)
    5746                            .dwattr $C$DW$T$458, DW_AT_language(DW_LANG_C)
    5747                            .dwattr $C$DW$T$458, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5748                            .dwattr $C$DW$T$458, DW_AT_decl_line(0x67)
    5749                            .dwattr $C$DW$T$458, DW_AT_decl_column(0x03)
    5750                    
    5751                    
    5752                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5753                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x28)
    5754                    $C$DW$564       .dwtag  DW_TAG_member
    5755                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$6)
    5756                            .dwattr $C$DW$564, DW_AT_name("SsidLen")
    5757                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("SsidLen")
    5758                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5759                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    5760                            .dwattr $C$DW$564, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5761                            .dwattr $C$DW$564, DW_AT_decl_line(0x1fd)
    5762                            .dwattr $C$DW$564, DW_AT_decl_column(0x0d)
    5763                    
    5764                    $C$DW$565       .dwtag  DW_TAG_member
    5765                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$21)
    5766                            .dwattr $C$DW$565, DW_AT_name("SsidName")
    5767                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("SsidName")
    5768                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5769                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    5770                            .dwattr $C$DW$565, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5771                            .dwattr $C$DW$565, DW_AT_decl_line(0x1fe)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  106

    5772                            .dwattr $C$DW$565, DW_AT_decl_column(0x0d)
    5773                    
    5774                    $C$DW$566       .dwtag  DW_TAG_member
    5775                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$22)
    5776                            .dwattr $C$DW$566, DW_AT_name("Bssid")
    5777                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("Bssid")
    5778                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5779                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    5780                            .dwattr $C$DW$566, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5781                            .dwattr $C$DW$566, DW_AT_decl_line(0x1ff)
    5782                            .dwattr $C$DW$566, DW_AT_decl_column(0x0d)
    5783                    
    5784                    $C$DW$567       .dwtag  DW_TAG_member
    5785                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$6)
    5786                            .dwattr $C$DW$567, DW_AT_name("Padding")
    5787                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("Padding")
    5788                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5789                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    5790                            .dwattr $C$DW$567, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5791                            .dwattr $C$DW$567, DW_AT_decl_line(0x200)
    5792                            .dwattr $C$DW$567, DW_AT_decl_column(0x0d)
    5793                    
    5794                            .dwattr $C$DW$T$23, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    5795                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x1fc)
    5796                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    5797                            .dwendtag $C$DW$T$23
    5798                    
    5799                    $C$DW$T$200     .dwtag  DW_TAG_typedef
    5800                            .dwattr $C$DW$T$200, DW_AT_name("SlWlanEventConnect_t")
    5801                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$23)
    5802                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    5803                            .dwattr $C$DW$T$200, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5804                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x201)
    5805                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x03)
    5806                    
    5807                    
    5808                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5809                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x4c)
    5810                    $C$DW$568       .dwtag  DW_TAG_member
    5811                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$6)
    5812                            .dwattr $C$DW$568, DW_AT_name("SsidLen")
    5813                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("SsidLen")
    5814                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    5816                            .dwattr $C$DW$568, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5817                            .dwattr $C$DW$568, DW_AT_decl_line(0x214)
    5818                            .dwattr $C$DW$568, DW_AT_decl_column(0x0d)
    5819                    
    5820                    $C$DW$569       .dwtag  DW_TAG_member
    5821                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$21)
    5822                            .dwattr $C$DW$569, DW_AT_name("SsidName")
    5823                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("SsidName")
    5824                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5825                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    5826                            .dwattr $C$DW$569, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  107

    5827                            .dwattr $C$DW$569, DW_AT_decl_line(0x215)
    5828                            .dwattr $C$DW$569, DW_AT_decl_column(0x0d)
    5829                    
    5830                    $C$DW$570       .dwtag  DW_TAG_member
    5831                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$22)
    5832                            .dwattr $C$DW$570, DW_AT_name("Bssid")
    5833                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("Bssid")
    5834                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5835                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    5836                            .dwattr $C$DW$570, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5837                            .dwattr $C$DW$570, DW_AT_decl_line(0x216)
    5838                            .dwattr $C$DW$570, DW_AT_decl_column(0x0d)
    5839                    
    5840                    $C$DW$571       .dwtag  DW_TAG_member
    5841                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$6)
    5842                            .dwattr $C$DW$571, DW_AT_name("Reserved")
    5843                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("Reserved")
    5844                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5845                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    5846                            .dwattr $C$DW$571, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5847                            .dwattr $C$DW$571, DW_AT_decl_line(0x217)
    5848                            .dwattr $C$DW$571, DW_AT_decl_column(0x0d)
    5849                    
    5850                    $C$DW$572       .dwtag  DW_TAG_member
    5851                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$6)
    5852                            .dwattr $C$DW$572, DW_AT_name("GoDeviceNameLen")
    5853                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("GoDeviceNameLen")
    5854                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5855                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    5856                            .dwattr $C$DW$572, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5857                            .dwattr $C$DW$572, DW_AT_decl_line(0x218)
    5858                            .dwattr $C$DW$572, DW_AT_decl_column(0x0d)
    5859                    
    5860                    $C$DW$573       .dwtag  DW_TAG_member
    5861                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$21)
    5862                            .dwattr $C$DW$573, DW_AT_name("GoDeviceName")
    5863                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("GoDeviceName")
    5864                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5865                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5866                            .dwattr $C$DW$573, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5867                            .dwattr $C$DW$573, DW_AT_decl_line(0x219)
    5868                            .dwattr $C$DW$573, DW_AT_decl_column(0x0d)
    5869                    
    5870                    $C$DW$574       .dwtag  DW_TAG_member
    5871                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    5872                            .dwattr $C$DW$574, DW_AT_name("Padding")
    5873                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("Padding")
    5874                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    5875                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    5876                            .dwattr $C$DW$574, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5877                            .dwattr $C$DW$574, DW_AT_decl_line(0x21a)
    5878                            .dwattr $C$DW$574, DW_AT_decl_column(0x0d)
    5879                    
    5880                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    5881                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x213)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  108

    5882                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    5883                            .dwendtag $C$DW$T$25
    5884                    
    5885                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    5886                            .dwattr $C$DW$T$201, DW_AT_name("SlWlanEventP2PConnect_t")
    5887                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$25)
    5888                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    5889                            .dwattr $C$DW$T$201, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5890                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x21b)
    5891                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    5892                    
    5893                    
    5894                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5895                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x50)
    5896                    $C$DW$575       .dwtag  DW_TAG_member
    5897                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$6)
    5898                            .dwattr $C$DW$575, DW_AT_name("Mode")
    5899                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("Mode")
    5900                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5901                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    5902                            .dwattr $C$DW$575, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5903                            .dwattr $C$DW$575, DW_AT_decl_line(0x2b3)
    5904                            .dwattr $C$DW$575, DW_AT_decl_column(0x09)
    5905                    
    5906                    $C$DW$576       .dwtag  DW_TAG_member
    5907                            .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$6)
    5908                            .dwattr $C$DW$576, DW_AT_name("ConnStatus")
    5909                            .dwattr $C$DW$576, DW_AT_TI_symbol_name("ConnStatus")
    5910                            .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5911                            .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    5912                            .dwattr $C$DW$576, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5913                            .dwattr $C$DW$576, DW_AT_decl_line(0x2b4)
    5914                            .dwattr $C$DW$576, DW_AT_decl_column(0x09)
    5915                    
    5916                    $C$DW$577       .dwtag  DW_TAG_member
    5917                            .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$6)
    5918                            .dwattr $C$DW$577, DW_AT_name("SecType")
    5919                            .dwattr $C$DW$577, DW_AT_TI_symbol_name("SecType")
    5920                            .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5921                            .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    5922                            .dwattr $C$DW$577, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5923                            .dwattr $C$DW$577, DW_AT_decl_line(0x2b5)
    5924                            .dwattr $C$DW$577, DW_AT_decl_column(0x09)
    5925                    
    5926                    $C$DW$578       .dwtag  DW_TAG_member
    5927                            .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$6)
    5928                            .dwattr $C$DW$578, DW_AT_name("Reserved")
    5929                            .dwattr $C$DW$578, DW_AT_TI_symbol_name("Reserved")
    5930                            .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5931                            .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    5932                            .dwattr $C$DW$578, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5933                            .dwattr $C$DW$578, DW_AT_decl_line(0x2b6)
    5934                            .dwattr $C$DW$578, DW_AT_decl_column(0x09)
    5935                    
    5936                    $C$DW$579       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  109

    5937                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$26)
    5938                            .dwattr $C$DW$579, DW_AT_name("ConnectionInfo")
    5939                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("ConnectionInfo")
    5940                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5941                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5942                            .dwattr $C$DW$579, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    5943                            .dwattr $C$DW$579, DW_AT_decl_line(0x2b7)
    5944                            .dwattr $C$DW$579, DW_AT_decl_column(0x1c)
    5945                    
    5946                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    5947                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2b2)
    5948                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    5949                            .dwendtag $C$DW$T$27
    5950                    
    5951                    $C$DW$T$459     .dwtag  DW_TAG_typedef
    5952                            .dwattr $C$DW$T$459, DW_AT_name("SlWlanConnStatusParam_t")
    5953                            .dwattr $C$DW$T$459, DW_AT_type(*$C$DW$T$27)
    5954                            .dwattr $C$DW$T$459, DW_AT_language(DW_LANG_C)
    5955                            .dwattr $C$DW$T$459, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    5956                            .dwattr $C$DW$T$459, DW_AT_decl_line(0x2b8)
    5957                            .dwattr $C$DW$T$459, DW_AT_decl_column(0x02)
    5958                    
    5959                    
    5960                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5961                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
    5962                    $C$DW$580       .dwtag  DW_TAG_member
    5963                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$14)
    5964                            .dwattr $C$DW$580, DW_AT_name("__max_align1")
    5965                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("__max_align1")
    5966                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5967                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5968                            .dwattr $C$DW$580, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.
    5969                            .dwattr $C$DW$580, DW_AT_decl_line(0x70)
    5970                            .dwattr $C$DW$580, DW_AT_decl_column(0x0c)
    5971                    
    5972                    $C$DW$581       .dwtag  DW_TAG_member
    5973                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$18)
    5974                            .dwattr $C$DW$581, DW_AT_name("__max_align2")
    5975                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("__max_align2")
    5976                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5977                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5978                            .dwattr $C$DW$581, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.
    5979                            .dwattr $C$DW$581, DW_AT_decl_line(0x71)
    5980                            .dwattr $C$DW$581, DW_AT_decl_column(0x0e)
    5981                    
    5982                            .dwattr $C$DW$T$28, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.1
    5983                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x6f)
    5984                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5985                            .dwendtag $C$DW$T$28
    5986                    
    5987                    $C$DW$T$461     .dwtag  DW_TAG_typedef
    5988                            .dwattr $C$DW$T$461, DW_AT_name("__max_align_t")
    5989                            .dwattr $C$DW$T$461, DW_AT_type(*$C$DW$T$28)
    5990                            .dwattr $C$DW$T$461, DW_AT_language(DW_LANG_C)
    5991                            .dwattr $C$DW$T$461, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  110

    5992                            .dwattr $C$DW$T$461, DW_AT_decl_line(0x72)
    5993                            .dwattr $C$DW$T$461, DW_AT_decl_column(0x03)
    5994                    
    5995                    
    5996                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5997                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    5998                    $C$DW$582       .dwtag  DW_TAG_member
    5999                            .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$31)
    6000                            .dwattr $C$DW$582, DW_AT_name("pEntry")
    6001                            .dwattr $C$DW$582, DW_AT_TI_symbol_name("pEntry")
    6002                            .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6003                            .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6004                            .dwattr $C$DW$582, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6005                            .dwattr $C$DW$582, DW_AT_decl_line(0x64)
    6006                            .dwattr $C$DW$582, DW_AT_decl_column(0x13)
    6007                    
    6008                    $C$DW$583       .dwtag  DW_TAG_member
    6009                            .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$3)
    6010                            .dwattr $C$DW$583, DW_AT_name("pValue")
    6011                            .dwattr $C$DW$583, DW_AT_TI_symbol_name("pValue")
    6012                            .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6013                            .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6014                            .dwattr $C$DW$583, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6015                            .dwattr $C$DW$583, DW_AT_decl_line(0x65)
    6016                            .dwattr $C$DW$583, DW_AT_decl_column(0x0b)
    6017                    
    6018                            .dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6019                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x63)
    6020                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    6021                            .dwendtag $C$DW$T$32
    6022                    
    6023                    $C$DW$T$462     .dwtag  DW_TAG_typedef
    6024                            .dwattr $C$DW$T$462, DW_AT_name("tSimpleLinkSpawnMsg")
    6025                            .dwattr $C$DW$T$462, DW_AT_type(*$C$DW$T$32)
    6026                            .dwattr $C$DW$T$462, DW_AT_language(DW_LANG_C)
    6027                            .dwattr $C$DW$T$462, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6028                            .dwattr $C$DW$T$462, DW_AT_decl_line(0x66)
    6029                            .dwattr $C$DW$T$462, DW_AT_decl_column(0x02)
    6030                    
    6031                    
    6032                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6033                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x24)
    6034                    $C$DW$584       .dwtag  DW_TAG_member
    6035                            .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$9)
    6036                            .dwattr $C$DW$584, DW_AT_name("Flags")
    6037                            .dwattr $C$DW$584, DW_AT_TI_symbol_name("Flags")
    6038                            .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6039                            .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6040                            .dwattr $C$DW$584, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6041                            .dwattr $C$DW$584, DW_AT_decl_line(0x90)
    6042                            .dwattr $C$DW$584, DW_AT_decl_column(0x0b)
    6043                    
    6044                    $C$DW$585       .dwtag  DW_TAG_member
    6045                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$13)
    6046                            .dwattr $C$DW$585, DW_AT_name("Len")
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  111

    6047                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("Len")
    6048                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6049                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6050                            .dwattr $C$DW$585, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6051                            .dwattr $C$DW$585, DW_AT_decl_line(0x91)
    6052                            .dwattr $C$DW$585, DW_AT_decl_column(0x0b)
    6053                    
    6054                    $C$DW$586       .dwtag  DW_TAG_member
    6055                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$13)
    6056                            .dwattr $C$DW$586, DW_AT_name("MaxSize")
    6057                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("MaxSize")
    6058                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6059                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6060                            .dwattr $C$DW$586, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6061                            .dwattr $C$DW$586, DW_AT_decl_line(0x92)
    6062                            .dwattr $C$DW$586, DW_AT_decl_column(0x0b)
    6063                    
    6064                    $C$DW$587       .dwtag  DW_TAG_member
    6065                            .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$33)
    6066                            .dwattr $C$DW$587, DW_AT_name("Token")
    6067                            .dwattr $C$DW$587, DW_AT_TI_symbol_name("Token")
    6068                            .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6069                            .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6070                            .dwattr $C$DW$587, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6071                            .dwattr $C$DW$587, DW_AT_decl_line(0x93)
    6072                            .dwattr $C$DW$587, DW_AT_decl_column(0x0b)
    6073                    
    6074                    $C$DW$588       .dwtag  DW_TAG_member
    6075                            .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$13)
    6076                            .dwattr $C$DW$588, DW_AT_name("StorageSize")
    6077                            .dwattr $C$DW$588, DW_AT_TI_symbol_name("StorageSize")
    6078                            .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6079                            .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6080                            .dwattr $C$DW$588, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6081                            .dwattr $C$DW$588, DW_AT_decl_line(0x94)
    6082                            .dwattr $C$DW$588, DW_AT_decl_column(0x0b)
    6083                    
    6084                    $C$DW$589       .dwtag  DW_TAG_member
    6085                            .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$13)
    6086                            .dwattr $C$DW$589, DW_AT_name("WriteCounter")
    6087                            .dwattr $C$DW$589, DW_AT_TI_symbol_name("WriteCounter")
    6088                            .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6089                            .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6090                            .dwattr $C$DW$589, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6091                            .dwattr $C$DW$589, DW_AT_decl_line(0x95)
    6092                            .dwattr $C$DW$589, DW_AT_decl_column(0x0b)
    6093                    
    6094                            .dwattr $C$DW$T$34, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6095                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x8f)
    6096                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6097                            .dwendtag $C$DW$T$34
    6098                    
    6099                    $C$DW$T$463     .dwtag  DW_TAG_typedef
    6100                            .dwattr $C$DW$T$463, DW_AT_name("SlFsFileInfo_t")
    6101                            .dwattr $C$DW$T$463, DW_AT_type(*$C$DW$T$34)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  112

    6102                            .dwattr $C$DW$T$463, DW_AT_language(DW_LANG_C)
    6103                            .dwattr $C$DW$T$463, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6104                            .dwattr $C$DW$T$463, DW_AT_decl_line(0x96)
    6105                            .dwattr $C$DW$T$463, DW_AT_decl_column(0x02)
    6106                    
    6107                    
    6108                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6109                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    6110                    $C$DW$590       .dwtag  DW_TAG_member
    6111                            .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$33)
    6112                            .dwattr $C$DW$590, DW_AT_name("Key")
    6113                            .dwattr $C$DW$590, DW_AT_TI_symbol_name("Key")
    6114                            .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6115                            .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6116                            .dwattr $C$DW$590, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6117                            .dwattr $C$DW$590, DW_AT_decl_line(0xb1)
    6118                            .dwattr $C$DW$590, DW_AT_decl_column(0x0b)
    6119                    
    6120                            .dwattr $C$DW$T$35, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6121                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xb0)
    6122                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    6123                            .dwendtag $C$DW$T$35
    6124                    
    6125                    $C$DW$T$464     .dwtag  DW_TAG_typedef
    6126                            .dwattr $C$DW$T$464, DW_AT_name("SlFsKey_t")
    6127                            .dwattr $C$DW$T$464, DW_AT_type(*$C$DW$T$35)
    6128                            .dwattr $C$DW$T$464, DW_AT_language(DW_LANG_C)
    6129                            .dwattr $C$DW$T$464, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6130                            .dwattr $C$DW$T$464, DW_AT_decl_line(0xb2)
    6131                            .dwattr $C$DW$T$464, DW_AT_decl_column(0x02)
    6132                    
    6133                    
    6134                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6135                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6136                    $C$DW$591       .dwtag  DW_TAG_member
    6137                            .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$6)
    6138                            .dwattr $C$DW$591, DW_AT_name("Index")
    6139                            .dwattr $C$DW$591, DW_AT_TI_symbol_name("Index")
    6140                            .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6141                            .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6142                            .dwattr $C$DW$591, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6143                            .dwattr $C$DW$591, DW_AT_decl_line(0xb6)
    6144                            .dwattr $C$DW$591, DW_AT_decl_column(0x09)
    6145                    
    6146                            .dwattr $C$DW$T$36, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6147                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xb5)
    6148                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6149                            .dwendtag $C$DW$T$36
    6150                    
    6151                    $C$DW$T$203     .dwtag  DW_TAG_typedef
    6152                            .dwattr $C$DW$T$203, DW_AT_name("SlFsFileNameIndex_t")
    6153                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$36)
    6154                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    6155                            .dwattr $C$DW$T$203, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6156                            .dwattr $C$DW$T$203, DW_AT_decl_line(0xb7)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  113

    6157                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x02)
    6158                    
    6159                    
    6160                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6161                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    6162                    $C$DW$592       .dwtag  DW_TAG_member
    6163                            .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$13)
    6164                            .dwattr $C$DW$592, DW_AT_name("Operation")
    6165                            .dwattr $C$DW$592, DW_AT_TI_symbol_name("Operation")
    6166                            .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6167                            .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6168                            .dwattr $C$DW$592, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6169                            .dwattr $C$DW$592, DW_AT_decl_line(0xca)
    6170                            .dwattr $C$DW$592, DW_AT_decl_column(0x08)
    6171                    
    6172                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6173                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xc9)
    6174                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6175                            .dwendtag $C$DW$T$37
    6176                    
    6177                    $C$DW$T$465     .dwtag  DW_TAG_typedef
    6178                            .dwattr $C$DW$T$465, DW_AT_name("SlFsRetToFactoryCommand_t")
    6179                            .dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$37)
    6180                            .dwattr $C$DW$T$465, DW_AT_language(DW_LANG_C)
    6181                            .dwattr $C$DW$T$465, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6182                            .dwattr $C$DW$T$465, DW_AT_decl_line(0xcb)
    6183                            .dwattr $C$DW$T$465, DW_AT_decl_column(0x02)
    6184                    
    6185                    
    6186                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6187                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    6188                    $C$DW$593       .dwtag  DW_TAG_member
    6189                            .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$13)
    6190                            .dwattr $C$DW$593, DW_AT_name("IncludeFilters")
    6191                            .dwattr $C$DW$593, DW_AT_TI_symbol_name("IncludeFilters")
    6192                            .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6193                            .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6194                            .dwattr $C$DW$593, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6195                            .dwattr $C$DW$593, DW_AT_decl_line(0xd1)
    6196                            .dwattr $C$DW$593, DW_AT_decl_column(0x12)
    6197                    
    6198                            .dwattr $C$DW$T$38, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6199                            .dwattr $C$DW$T$38, DW_AT_decl_line(0xd0)
    6200                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    6201                            .dwendtag $C$DW$T$38
    6202                    
    6203                    $C$DW$T$466     .dwtag  DW_TAG_typedef
    6204                            .dwattr $C$DW$T$466, DW_AT_name("SlFsControl_t")
    6205                            .dwattr $C$DW$T$466, DW_AT_type(*$C$DW$T$38)
    6206                            .dwattr $C$DW$T$466, DW_AT_language(DW_LANG_C)
    6207                            .dwattr $C$DW$T$466, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6208                            .dwattr $C$DW$T$466, DW_AT_decl_line(0xd3)
    6209                            .dwattr $C$DW$T$466, DW_AT_decl_column(0x02)
    6210                    
    6211                    
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  114

    6212                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6213                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    6214                    $C$DW$594       .dwtag  DW_TAG_member
    6215                            .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$9)
    6216                            .dwattr $C$DW$594, DW_AT_name("DeviceBlockSize")
    6217                            .dwattr $C$DW$594, DW_AT_TI_symbol_name("DeviceBlockSize")
    6218                            .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6219                            .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6220                            .dwattr $C$DW$594, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6221                            .dwattr $C$DW$594, DW_AT_decl_line(0xd7)
    6222                            .dwattr $C$DW$594, DW_AT_decl_column(0x08)
    6223                    
    6224                    $C$DW$595       .dwtag  DW_TAG_member
    6225                            .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$9)
    6226                            .dwattr $C$DW$595, DW_AT_name("DeviceBlocksCapacity")
    6227                            .dwattr $C$DW$595, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    6228                            .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6229                            .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6230                            .dwattr $C$DW$595, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6231                            .dwattr $C$DW$595, DW_AT_decl_line(0xd8)
    6232                            .dwattr $C$DW$595, DW_AT_decl_column(0x08)
    6233                    
    6234                    $C$DW$596       .dwtag  DW_TAG_member
    6235                            .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$9)
    6236                            .dwattr $C$DW$596, DW_AT_name("NumOfAllocatedBlocks")
    6237                            .dwattr $C$DW$596, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    6238                            .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6239                            .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6240                            .dwattr $C$DW$596, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6241                            .dwattr $C$DW$596, DW_AT_decl_line(0xd9)
    6242                            .dwattr $C$DW$596, DW_AT_decl_column(0x08)
    6243                    
    6244                    $C$DW$597       .dwtag  DW_TAG_member
    6245                            .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$9)
    6246                            .dwattr $C$DW$597, DW_AT_name("NumOfReservedBlocks")
    6247                            .dwattr $C$DW$597, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    6248                            .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6249                            .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6250                            .dwattr $C$DW$597, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6251                            .dwattr $C$DW$597, DW_AT_decl_line(0xda)
    6252                            .dwattr $C$DW$597, DW_AT_decl_column(0x08)
    6253                    
    6254                    $C$DW$598       .dwtag  DW_TAG_member
    6255                            .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$9)
    6256                            .dwattr $C$DW$598, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    6257                            .dwattr $C$DW$598, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    6258                            .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6259                            .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6260                            .dwattr $C$DW$598, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6261                            .dwattr $C$DW$598, DW_AT_decl_line(0xdb)
    6262                            .dwattr $C$DW$598, DW_AT_decl_column(0x08)
    6263                    
    6264                    $C$DW$599       .dwtag  DW_TAG_member
    6265                            .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$9)
    6266                            .dwattr $C$DW$599, DW_AT_name("LargestAllocatedGapInBlocks")
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  115

    6267                            .dwattr $C$DW$599, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    6268                            .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6269                            .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6270                            .dwattr $C$DW$599, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6271                            .dwattr $C$DW$599, DW_AT_decl_line(0xdc)
    6272                            .dwattr $C$DW$599, DW_AT_decl_column(0x08)
    6273                    
    6274                    $C$DW$600       .dwtag  DW_TAG_member
    6275                            .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$9)
    6276                            .dwattr $C$DW$600, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    6277                            .dwattr $C$DW$600, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    6278                            .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6279                            .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6280                            .dwattr $C$DW$600, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6281                            .dwattr $C$DW$600, DW_AT_decl_line(0xdd)
    6282                            .dwattr $C$DW$600, DW_AT_decl_column(0x08)
    6283                    
    6284                    $C$DW$601       .dwtag  DW_TAG_member
    6285                            .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$39)
    6286                            .dwattr $C$DW$601, DW_AT_name("Padding")
    6287                            .dwattr $C$DW$601, DW_AT_TI_symbol_name("Padding")
    6288                            .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6289                            .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6290                            .dwattr $C$DW$601, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6291                            .dwattr $C$DW$601, DW_AT_decl_line(0xde)
    6292                            .dwattr $C$DW$601, DW_AT_decl_column(0x08)
    6293                    
    6294                            .dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6295                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xd6)
    6296                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    6297                            .dwendtag $C$DW$T$40
    6298                    
    6299                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    6300                            .dwattr $C$DW$T$42, DW_AT_name("SlFsControlDeviceUsage_t")
    6301                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    6302                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    6303                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6304                            .dwattr $C$DW$T$42, DW_AT_decl_line(0xdf)
    6305                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    6306                    
    6307                    
    6308                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6309                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    6310                    $C$DW$602       .dwtag  DW_TAG_member
    6311                            .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$6)
    6312                            .dwattr $C$DW$602, DW_AT_name("MaxFsFiles")
    6313                            .dwattr $C$DW$602, DW_AT_TI_symbol_name("MaxFsFiles")
    6314                            .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6315                            .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6316                            .dwattr $C$DW$602, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6317                            .dwattr $C$DW$602, DW_AT_decl_line(0xe3)
    6318                            .dwattr $C$DW$602, DW_AT_decl_column(0x08)
    6319                    
    6320                    $C$DW$603       .dwtag  DW_TAG_member
    6321                            .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  116

    6322                            .dwattr $C$DW$603, DW_AT_name("IsDevlopmentFormatType")
    6323                            .dwattr $C$DW$603, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    6324                            .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6325                            .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6326                            .dwattr $C$DW$603, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6327                            .dwattr $C$DW$603, DW_AT_decl_line(0xe4)
    6328                            .dwattr $C$DW$603, DW_AT_decl_column(0x08)
    6329                    
    6330                    $C$DW$604       .dwtag  DW_TAG_member
    6331                            .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$6)
    6332                            .dwattr $C$DW$604, DW_AT_name("Bundlestate")
    6333                            .dwattr $C$DW$604, DW_AT_TI_symbol_name("Bundlestate")
    6334                            .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6335                            .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6336                            .dwattr $C$DW$604, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6337                            .dwattr $C$DW$604, DW_AT_decl_line(0xe5)
    6338                            .dwattr $C$DW$604, DW_AT_decl_column(0x08)
    6339                    
    6340                    $C$DW$605       .dwtag  DW_TAG_member
    6341                            .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$6)
    6342                            .dwattr $C$DW$605, DW_AT_name("Reserved")
    6343                            .dwattr $C$DW$605, DW_AT_TI_symbol_name("Reserved")
    6344                            .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6345                            .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6346                            .dwattr $C$DW$605, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6347                            .dwattr $C$DW$605, DW_AT_decl_line(0xe6)
    6348                            .dwattr $C$DW$605, DW_AT_decl_column(0x08)
    6349                    
    6350                    $C$DW$606       .dwtag  DW_TAG_member
    6351                            .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$6)
    6352                            .dwattr $C$DW$606, DW_AT_name("MaxFsFilesReservedForSysFiles")
    6353                            .dwattr $C$DW$606, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    6354                            .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6355                            .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6356                            .dwattr $C$DW$606, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6357                            .dwattr $C$DW$606, DW_AT_decl_line(0xe7)
    6358                            .dwattr $C$DW$606, DW_AT_decl_column(0x08)
    6359                    
    6360                    $C$DW$607       .dwtag  DW_TAG_member
    6361                            .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$6)
    6362                            .dwattr $C$DW$607, DW_AT_name("ActualNumOfUserFiles")
    6363                            .dwattr $C$DW$607, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    6364                            .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6365                            .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6366                            .dwattr $C$DW$607, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6367                            .dwattr $C$DW$607, DW_AT_decl_line(0xe8)
    6368                            .dwattr $C$DW$607, DW_AT_decl_column(0x08)
    6369                    
    6370                    $C$DW$608       .dwtag  DW_TAG_member
    6371                            .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$6)
    6372                            .dwattr $C$DW$608, DW_AT_name("ActualNumOfSysFiles")
    6373                            .dwattr $C$DW$608, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    6374                            .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6375                            .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6376                            .dwattr $C$DW$608, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  117

    6377                            .dwattr $C$DW$608, DW_AT_decl_line(0xe9)
    6378                            .dwattr $C$DW$608, DW_AT_decl_column(0x08)
    6379                    
    6380                    $C$DW$609       .dwtag  DW_TAG_member
    6381                            .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$6)
    6382                            .dwattr $C$DW$609, DW_AT_name("Padding")
    6383                            .dwattr $C$DW$609, DW_AT_TI_symbol_name("Padding")
    6384                            .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6385                            .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6386                            .dwattr $C$DW$609, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6387                            .dwattr $C$DW$609, DW_AT_decl_line(0xea)
    6388                            .dwattr $C$DW$609, DW_AT_decl_column(0x08)
    6389                    
    6390                    $C$DW$610       .dwtag  DW_TAG_member
    6391                            .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$13)
    6392                            .dwattr $C$DW$610, DW_AT_name("NumOfAlerts")
    6393                            .dwattr $C$DW$610, DW_AT_TI_symbol_name("NumOfAlerts")
    6394                            .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6395                            .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6396                            .dwattr $C$DW$610, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6397                            .dwattr $C$DW$610, DW_AT_decl_line(0xeb)
    6398                            .dwattr $C$DW$610, DW_AT_decl_column(0x08)
    6399                    
    6400                    $C$DW$611       .dwtag  DW_TAG_member
    6401                            .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$13)
    6402                            .dwattr $C$DW$611, DW_AT_name("NumOfAlertsThreshold")
    6403                            .dwattr $C$DW$611, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    6404                            .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6405                            .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6406                            .dwattr $C$DW$611, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6407                            .dwattr $C$DW$611, DW_AT_decl_line(0xec)
    6408                            .dwattr $C$DW$611, DW_AT_decl_column(0x08)
    6409                    
    6410                    $C$DW$612       .dwtag  DW_TAG_member
    6411                            .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$9)
    6412                            .dwattr $C$DW$612, DW_AT_name("FATWriteCounter")
    6413                            .dwattr $C$DW$612, DW_AT_TI_symbol_name("FATWriteCounter")
    6414                            .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6415                            .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6416                            .dwattr $C$DW$612, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6417                            .dwattr $C$DW$612, DW_AT_decl_line(0xed)
    6418                            .dwattr $C$DW$612, DW_AT_decl_column(0x08)
    6419                    
    6420                    $C$DW$613       .dwtag  DW_TAG_member
    6421                            .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$9)
    6422                            .dwattr $C$DW$613, DW_AT_name("Padding2")
    6423                            .dwattr $C$DW$613, DW_AT_TI_symbol_name("Padding2")
    6424                            .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6425                            .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6426                            .dwattr $C$DW$613, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6427                            .dwattr $C$DW$613, DW_AT_decl_line(0xee)
    6428                            .dwattr $C$DW$613, DW_AT_decl_column(0x08)
    6429                    
    6430                            .dwattr $C$DW$T$41, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6431                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xe2)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  118

    6432                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6433                            .dwendtag $C$DW$T$41
    6434                    
    6435                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    6436                            .dwattr $C$DW$T$43, DW_AT_name("SlFsControlFilesUsage_t")
    6437                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$41)
    6438                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6439                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6440                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xef)
    6441                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x02)
    6442                    
    6443                    
    6444                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6445                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x24)
    6446                    $C$DW$614       .dwtag  DW_TAG_member
    6447                            .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$42)
    6448                            .dwattr $C$DW$614, DW_AT_name("DeviceUsage")
    6449                            .dwattr $C$DW$614, DW_AT_TI_symbol_name("DeviceUsage")
    6450                            .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6451                            .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6452                            .dwattr $C$DW$614, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6453                            .dwattr $C$DW$614, DW_AT_decl_line(0xf4)
    6454                            .dwattr $C$DW$614, DW_AT_decl_column(0x1e)
    6455                    
    6456                    $C$DW$615       .dwtag  DW_TAG_member
    6457                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$43)
    6458                            .dwattr $C$DW$615, DW_AT_name("FilesUsage")
    6459                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("FilesUsage")
    6460                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6461                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6462                            .dwattr $C$DW$615, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6463                            .dwattr $C$DW$615, DW_AT_decl_line(0xf5)
    6464                            .dwattr $C$DW$615, DW_AT_decl_column(0x1e)
    6465                    
    6466                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6467                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xf3)
    6468                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    6469                            .dwendtag $C$DW$T$44
    6470                    
    6471                    $C$DW$T$467     .dwtag  DW_TAG_typedef
    6472                            .dwattr $C$DW$T$467, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    6473                            .dwattr $C$DW$T$467, DW_AT_type(*$C$DW$T$44)
    6474                            .dwattr $C$DW$T$467, DW_AT_language(DW_LANG_C)
    6475                            .dwattr $C$DW$T$467, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6476                            .dwattr $C$DW$T$467, DW_AT_decl_line(0xf6)
    6477                            .dwattr $C$DW$T$467, DW_AT_decl_column(0x03)
    6478                    
    6479                    
    6480                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6481                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x0c)
    6482                    $C$DW$616       .dwtag  DW_TAG_member
    6483                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$13)
    6484                            .dwattr $C$DW$616, DW_AT_name("IncludeFilters")
    6485                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("IncludeFilters")
    6486                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  119

    6487                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6488                            .dwattr $C$DW$616, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6489                            .dwattr $C$DW$616, DW_AT_decl_line(0xfa)
    6490                            .dwattr $C$DW$616, DW_AT_decl_column(0x0b)
    6491                    
    6492                    $C$DW$617       .dwtag  DW_TAG_member
    6493                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$6)
    6494                            .dwattr $C$DW$617, DW_AT_name("OpenedForWriteCnt")
    6495                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    6496                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6497                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6498                            .dwattr $C$DW$617, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6499                            .dwattr $C$DW$617, DW_AT_decl_line(0xfb)
    6500                            .dwattr $C$DW$617, DW_AT_decl_column(0x0b)
    6501                    
    6502                    $C$DW$618       .dwtag  DW_TAG_member
    6503                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$6)
    6504                            .dwattr $C$DW$618, DW_AT_name("OpeneForReadCnt")
    6505                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("OpeneForReadCnt")
    6506                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6507                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6508                            .dwattr $C$DW$618, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6509                            .dwattr $C$DW$618, DW_AT_decl_line(0xfc)
    6510                            .dwattr $C$DW$618, DW_AT_decl_column(0x0b)
    6511                    
    6512                    $C$DW$619       .dwtag  DW_TAG_member
    6513                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$6)
    6514                            .dwattr $C$DW$619, DW_AT_name("ClosedFilesCnt")
    6515                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("ClosedFilesCnt")
    6516                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6517                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6518                            .dwattr $C$DW$619, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6519                            .dwattr $C$DW$619, DW_AT_decl_line(0xfd)
    6520                            .dwattr $C$DW$619, DW_AT_decl_column(0x0b)
    6521                    
    6522                    $C$DW$620       .dwtag  DW_TAG_member
    6523                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$6)
    6524                            .dwattr $C$DW$620, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    6525                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    6526                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6527                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6528                            .dwattr $C$DW$620, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6529                            .dwattr $C$DW$620, DW_AT_decl_line(0xfe)
    6530                            .dwattr $C$DW$620, DW_AT_decl_column(0x0b)
    6531                    
    6532                    $C$DW$621       .dwtag  DW_TAG_member
    6533                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$6)
    6534                            .dwattr $C$DW$621, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    6535                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    6536                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6537                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6538                            .dwattr $C$DW$621, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6539                            .dwattr $C$DW$621, DW_AT_decl_line(0xff)
    6540                            .dwattr $C$DW$621, DW_AT_decl_column(0x0b)
    6541                    
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  120

    6542                    $C$DW$622       .dwtag  DW_TAG_member
    6543                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$6)
    6544                            .dwattr $C$DW$622, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    6545                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    6546                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6547                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6548                            .dwattr $C$DW$622, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6549                            .dwattr $C$DW$622, DW_AT_decl_line(0x100)
    6550                            .dwattr $C$DW$622, DW_AT_decl_column(0x0b)
    6551                    
    6552                    $C$DW$623       .dwtag  DW_TAG_member
    6553                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$39)
    6554                            .dwattr $C$DW$623, DW_AT_name("padding")
    6555                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("padding")
    6556                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6557                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6558                            .dwattr $C$DW$623, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6559                            .dwattr $C$DW$623, DW_AT_decl_line(0x101)
    6560                            .dwattr $C$DW$623, DW_AT_decl_column(0x0b)
    6561                    
    6562                            .dwattr $C$DW$T$45, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6563                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xf9)
    6564                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    6565                            .dwendtag $C$DW$T$45
    6566                    
    6567                    $C$DW$T$468     .dwtag  DW_TAG_typedef
    6568                            .dwattr $C$DW$T$468, DW_AT_name("SlFsControlGetCountersResponse_t")
    6569                            .dwattr $C$DW$T$468, DW_AT_type(*$C$DW$T$45)
    6570                            .dwattr $C$DW$T$468, DW_AT_language(DW_LANG_C)
    6571                            .dwattr $C$DW$T$468, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6572                            .dwattr $C$DW$T$468, DW_AT_decl_line(0x102)
    6573                            .dwattr $C$DW$T$468, DW_AT_decl_column(0x03)
    6574                    
    6575                    
    6576                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6577                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    6578                    $C$DW$624       .dwtag  DW_TAG_member
    6579                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$13)
    6580                            .dwattr $C$DW$624, DW_AT_name("FileMaxSize")
    6581                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("FileMaxSize")
    6582                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6583                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6584                            .dwattr $C$DW$624, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6585                            .dwattr $C$DW$624, DW_AT_decl_line(0x111)
    6586                            .dwattr $C$DW$624, DW_AT_decl_column(0x0a)
    6587                    
    6588                    $C$DW$625       .dwtag  DW_TAG_member
    6589                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$13)
    6590                            .dwattr $C$DW$625, DW_AT_name("Properties")
    6591                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("Properties")
    6592                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6593                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6594                            .dwattr $C$DW$625, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6595                            .dwattr $C$DW$625, DW_AT_decl_line(0x112)
    6596                            .dwattr $C$DW$625, DW_AT_decl_column(0x0a)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  121

    6597                    
    6598                    $C$DW$626       .dwtag  DW_TAG_member
    6599                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$13)
    6600                            .dwattr $C$DW$626, DW_AT_name("FileAllocatedBlocks")
    6601                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    6602                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6603                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6604                            .dwattr $C$DW$626, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6605                            .dwattr $C$DW$626, DW_AT_decl_line(0x113)
    6606                            .dwattr $C$DW$626, DW_AT_decl_column(0x0a)
    6607                    
    6608                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6609                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x110)
    6610                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    6611                            .dwendtag $C$DW$T$46
    6612                    
    6613                    $C$DW$T$469     .dwtag  DW_TAG_typedef
    6614                            .dwattr $C$DW$T$469, DW_AT_name("SlFileAttributes_t")
    6615                            .dwattr $C$DW$T$469, DW_AT_type(*$C$DW$T$46)
    6616                            .dwattr $C$DW$T$469, DW_AT_language(DW_LANG_C)
    6617                            .dwattr $C$DW$T$469, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6618                            .dwattr $C$DW$T$469, DW_AT_decl_line(0x114)
    6619                            .dwattr $C$DW$T$469, DW_AT_decl_column(0x02)
    6620                    
    6621                    
    6622                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6623                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    6624                    $C$DW$627       .dwtag  DW_TAG_member
    6625                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$13)
    6626                            .dwattr $C$DW$627, DW_AT_name("KeepaliveEnabled")
    6627                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("KeepaliveEnabled")
    6628                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6629                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6630                            .dwattr $C$DW$627, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6631                            .dwattr $C$DW$627, DW_AT_decl_line(0xf6)
    6632                            .dwattr $C$DW$627, DW_AT_decl_column(0x0a)
    6633                    
    6634                            .dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6635                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xf5)
    6636                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    6637                            .dwendtag $C$DW$T$47
    6638                    
    6639                    $C$DW$T$470     .dwtag  DW_TAG_typedef
    6640                            .dwattr $C$DW$T$470, DW_AT_name("SlSockKeepalive_t")
    6641                            .dwattr $C$DW$T$470, DW_AT_type(*$C$DW$T$47)
    6642                            .dwattr $C$DW$T$470, DW_AT_language(DW_LANG_C)
    6643                            .dwattr $C$DW$T$470, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6644                            .dwattr $C$DW$T$470, DW_AT_decl_line(0xf7)
    6645                            .dwattr $C$DW$T$470, DW_AT_decl_column(0x02)
    6646                    
    6647                    
    6648                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6649                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    6650                    $C$DW$628       .dwtag  DW_TAG_member
    6651                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$13)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  122

    6652                            .dwattr $C$DW$628, DW_AT_name("ReuseaddrEnabled")
    6653                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("ReuseaddrEnabled")
    6654                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6655                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6656                            .dwattr $C$DW$628, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6657                            .dwattr $C$DW$628, DW_AT_decl_line(0xfb)
    6658                            .dwattr $C$DW$628, DW_AT_decl_column(0x0a)
    6659                    
    6660                            .dwattr $C$DW$T$48, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6661                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xfa)
    6662                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    6663                            .dwendtag $C$DW$T$48
    6664                    
    6665                    $C$DW$T$471     .dwtag  DW_TAG_typedef
    6666                            .dwattr $C$DW$T$471, DW_AT_name("SlSockReuseaddr_t")
    6667                            .dwattr $C$DW$T$471, DW_AT_type(*$C$DW$T$48)
    6668                            .dwattr $C$DW$T$471, DW_AT_language(DW_LANG_C)
    6669                            .dwattr $C$DW$T$471, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6670                            .dwattr $C$DW$T$471, DW_AT_decl_line(0xfc)
    6671                            .dwattr $C$DW$T$471, DW_AT_decl_column(0x02)
    6672                    
    6673                    
    6674                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    6675                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    6676                    $C$DW$629       .dwtag  DW_TAG_member
    6677                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$12)
    6678                            .dwattr $C$DW$629, DW_AT_name("RxIpNoBoundaryEnabled")
    6679                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
    6680                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6681                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6682                            .dwattr $C$DW$629, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6683                            .dwattr $C$DW$629, DW_AT_decl_line(0x100)
    6684                            .dwattr $C$DW$629, DW_AT_decl_column(0x0a)
    6685                    
    6686                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6687                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xff)
    6688                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    6689                            .dwendtag $C$DW$T$49
    6690                    
    6691                    $C$DW$T$472     .dwtag  DW_TAG_typedef
    6692                            .dwattr $C$DW$T$472, DW_AT_name("SlSockRxNoIpBoundary_t")
    6693                            .dwattr $C$DW$T$472, DW_AT_type(*$C$DW$T$49)
    6694                            .dwattr $C$DW$T$472, DW_AT_language(DW_LANG_C)
    6695                            .dwattr $C$DW$T$472, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6696                            .dwattr $C$DW$T$472, DW_AT_decl_line(0x101)
    6697                            .dwattr $C$DW$T$472, DW_AT_decl_column(0x03)
    6698                    
    6699                    
    6700                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6701                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    6702                    $C$DW$630       .dwtag  DW_TAG_member
    6703                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$13)
    6704                            .dwattr $C$DW$630, DW_AT_name("WinSize")
    6705                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("WinSize")
    6706                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  123

    6707                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6708                            .dwattr $C$DW$630, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6709                            .dwattr $C$DW$630, DW_AT_decl_line(0x105)
    6710                            .dwattr $C$DW$630, DW_AT_decl_column(0x0a)
    6711                    
    6712                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6713                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x104)
    6714                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    6715                            .dwendtag $C$DW$T$50
    6716                    
    6717                    $C$DW$T$473     .dwtag  DW_TAG_typedef
    6718                            .dwattr $C$DW$T$473, DW_AT_name("SlSockWinsize_t")
    6719                            .dwattr $C$DW$T$473, DW_AT_type(*$C$DW$T$50)
    6720                            .dwattr $C$DW$T$473, DW_AT_language(DW_LANG_C)
    6721                            .dwattr $C$DW$T$473, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6722                            .dwattr $C$DW$T$473, DW_AT_decl_line(0x106)
    6723                            .dwattr $C$DW$T$473, DW_AT_decl_column(0x02)
    6724                    
    6725                    
    6726                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    6727                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    6728                    $C$DW$631       .dwtag  DW_TAG_member
    6729                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$13)
    6730                            .dwattr $C$DW$631, DW_AT_name("NonBlockingEnabled")
    6731                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("NonBlockingEnabled")
    6732                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6733                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6734                            .dwattr $C$DW$631, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6735                            .dwattr $C$DW$631, DW_AT_decl_line(0x10a)
    6736                            .dwattr $C$DW$631, DW_AT_decl_column(0x0a)
    6737                    
    6738                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6739                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x109)
    6740                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    6741                            .dwendtag $C$DW$T$51
    6742                    
    6743                    $C$DW$T$474     .dwtag  DW_TAG_typedef
    6744                            .dwattr $C$DW$T$474, DW_AT_name("SlSockNonblocking_t")
    6745                            .dwattr $C$DW$T$474, DW_AT_type(*$C$DW$T$51)
    6746                            .dwattr $C$DW$T$474, DW_AT_language(DW_LANG_C)
    6747                            .dwattr $C$DW$T$474, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6748                            .dwattr $C$DW$T$474, DW_AT_decl_line(0x10b)
    6749                            .dwattr $C$DW$T$474, DW_AT_decl_column(0x02)
    6750                    
    6751                    
    6752                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    6753                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x84)
    6754                    $C$DW$632       .dwtag  DW_TAG_member
    6755                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$6)
    6756                            .dwattr $C$DW$632, DW_AT_name("Sd")
    6757                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("Sd")
    6758                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6759                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6760                            .dwattr $C$DW$632, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6761                            .dwattr $C$DW$632, DW_AT_decl_line(0x10f)
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  124

    6762                            .dwattr $C$DW$632, DW_AT_decl_column(0x0b)
    6763                    
    6764                    $C$DW$633       .dwtag  DW_TAG_member
    6765                            .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$6)
    6766                            .dwattr $C$DW$633, DW_AT_name("Type")
    6767                            .dwattr $C$DW$633, DW_AT_TI_symbol_name("Type")
    6768                            .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6769                            .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6770                            .dwattr $C$DW$633, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6771                            .dwattr $C$DW$633, DW_AT_decl_line(0x110)
    6772                            .dwattr $C$DW$633, DW_AT_decl_column(0x0b)
    6773                    
    6774                    $C$DW$634       .dwtag  DW_TAG_member
    6775                            .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$8)
    6776                            .dwattr $C$DW$634, DW_AT_name("Val")
    6777                            .dwattr $C$DW$634, DW_AT_TI_symbol_name("Val")
    6778                            .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6779                            .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6780                            .dwattr $C$DW$634, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6781                            .dwattr $C$DW$634, DW_AT_decl_line(0x111)
    6782                            .dwattr $C$DW$634, DW_AT_decl_column(0x0b)
    6783                    
    6784                    $C$DW$635       .dwtag  DW_TAG_member
    6785                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$52)
    6786                            .dwattr $C$DW$635, DW_AT_name("pExtraInfo")
    6787                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("pExtraInfo")
    6788                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6789                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6790                            .dwattr $C$DW$635, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6791                            .dwattr $C$DW$635, DW_AT_decl_line(0x112)
    6792                            .dwattr $C$DW$635, DW_AT_decl_column(0x0b)
    6793                    
    6794                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6795                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x10e)
    6796                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    6797                            .dwendtag $C$DW$T$53
    6798                    
    6799                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    6800                            .dwattr $C$DW$T$207, DW_AT_name("SlSocketAsyncEvent_t")
    6801                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$53)
    6802                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    6803                            .dwattr $C$DW$T$207, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6804                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x113)
    6805                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x03)
    6806                    
    6807                    
    6808                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    6809                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    6810                    $C$DW$636       .dwtag  DW_TAG_member
    6811                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$8)
    6812                            .dwattr $C$DW$636, DW_AT_name("Status")
    6813                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("Status")
    6814                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6815                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6816                            .dwattr $C$DW$636, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
TI ARM Assembler Unix v18.1.1 Fri Mar  9 14:28:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  125

    6817                            .dwattr $C$DW$636, DW_AT_decl_line(0x117)
    6818                            .dwattr $C$DW$636, DW_AT_decl_column(0x10)
    6819                    
    6820                    $C$DW$637       .dwtag  DW_TAG_member
    6821                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$6)
    6822                            .dwattr $C$DW$637, DW_AT_name("Sd")
    6823                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("Sd")
    6824                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6825                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6826                            .dwattr $C$DW$637, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6827                            .dwattr $C$DW$637, DW_AT_decl_line(0x118)
    6828                            .dwattr $C$DW$637, DW_AT_decl_column(0x10)
    6829                    
    6830                    $C$DW$638       .dwtag  DW_TAG_member
    6831                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$6)
    6832                            .dwattr $C$DW$638, DW_AT_name("Padding")
    6833                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("Padding")
    6834                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6835                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6836                            .dwattr $C$DW$638, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti/
    6837                            .dwattr $C$DW$638, DW_AT_decl_line(0x119)
    6838                            .dwattr $C$DW$638, DW_AT_decl_column(0x10)
    6839                    
    6840                            .dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/ti
    6841                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x116)
    6842                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    6843                            .dwendtag $C$DW$T$54
    6844                    
    6845                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    6846                            .dwattr $C$DW$T$206, DW_AT_name("SlSockTxFailEventData_t")
    6847                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$54)
    6848                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    6849                            .dwattr $C$DW$T$206, DW_AT_decl_file("/vagrant/SDK_Q1_07032018_2.10.00.04_GA/sdk_root/source/t
    6850                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x11a)
    6851                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x03)
    6852                    
    6853                    
